[
    {
        "company": "NASCAR",
        "title": "Discord App Developer",
        "image": "nascar.png",
        "started": 1633042800,
        "ended": 4128710400,
        "description": "During the 2021 & 2022 race seasons, I adapted NASCAR's audio stream tech to be able to stream into Discord voice/stage channels. During the 2022 season, I expanded app functionality to have several public commands surfacing info about drivers & live play-by-play race updates, as part of a launch partnership with Discord's App Directory feature"
    },
    {
        "company": "Discord",
        "title": "Discord App Developer",
        "image": "discord.png",
        "started": 1664578800,
        "ended": 1667260800,
        "description": "In October 2022, Discord reached out for assistance in creating a Discord App for the American Music Awards, allowing users to vote in the 'Favourite KPOP Artist' category. I created this application to their specification, using scalable tech able to handle the millions of vote events across the voting period. This app was featured on Discord's App Directory during the voting period."
    },
    {
        "company": "GamerSafer",
        "title": "Product Manager",
        "image": "gs.png",
        "started": 1640995200,
        "ended": 1664578800,
        "description": "GamerSafer extended this opportunity to manage the expansion of their existing products into Discord's safety ecosystem. This scope includes Discord bot applications, user resources & development of existing & future tooling. Responsibilites include community outreach, cybersecurity & anti-abuse development, product planning & project management."
    },
    {
        "company": "StockX",
        "title": "Discord App Developer",
        "image": "stockx.png",
        "started": 1656630000,
        "ended": 1664578800,
        "description": "The opportunity to develop a Discord App for StockX was offered via Discord, StockX was selected to be a launch partner for Discord's App Directory feature. For this project, I developed a Discord App that allowed users to play in weekly trivia, enter giveaways and get info about the latest StockX drops. The StockX DropBot was featured in the App Dirctory on launch & rapidly obtained thousands of users."
    },
    {
        "company": "Magoosh",
        "title": "Discord App Developer",
        "image": "magoosh.png",
        "started": 1656630000,
        "ended": 1664578800,
        "description": "The opportunity to develop a Discord App for Magoosh was offered via Discord, Magoosh was selected to be a launch partner for Discord's App Directory feature. Magoosh was aiming to bring more educational content to Discord, I aided them in doing this by importing questions into Discord, surfacing them as daily challenges. Users of the Magooshy app could do daily & on demand questions & track their progress on leaderboards."
    },
    {
        "company": "Rythm",
        "title": "Strategy Consultant",
        "image": "rythm.png",
        "started": 1651359600,
        "ended": 1656630000,
        "description": "Owners of the largest music bot on Discord, Rythm consulted me for strategy insights pertaining to their future business endavours. Throughout this consultation I was able to provide meaningful feedback on developmental plans & aid in ensuring potential future roadblocks were navigated."
    },
    {
        "company": "Panley Entertainment",
        "title": "Sole Trader",
        "image": "panleyent.png",
        "started": 1572566400,
        "ended": 4128710400,
        "description": "Panley Entertainment, as a sole tradership, is the centre for all of my contract & freelance work as well as my various products. Over time it's developed from an intiative targeted at platforming content creators into a personal company for aiding me in centralising all of my work. All projects you see on this site are offered under the umbrella of Panley Entertainment. Running a sole tradership for as long as I have is a very challenging but rewarding experience, and has taught me alot about business & brand management."
    }
]